[Killed] BlockStatement
src/limits/concurrency.ts:18:28
   constructor(private readonly max: number) {}
 
   /** Whether every slot is taken. The single definition of "full" — tryAcquire consults it. */
-  get saturated(): boolean {
-    return this.active >= this.max;
-  }
+  get saturated(): boolean {}
 
   /**
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected [Function] to be null

[Killed] ConditionalExpression
src/limits/concurrency.ts:19:12
 
   /** Whether every slot is taken. The single definition of "full" — tryAcquire consults it. */
   get saturated(): boolean {
-    return this.active >= this.max;
+    return false;
   }
 
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected [Function] to be null

[Killed] EqualityOperator
src/limits/concurrency.ts:19:12
 
   /** Whether every slot is taken. The single definition of "full" — tryAcquire consults it. */
   get saturated(): boolean {
-    return this.active >= this.max;
+    return this.active < this.max;
   }
 
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected null not to be null

[Killed] BlockStatement
src/limits/concurrency.ts:27:37
    * double release must not invent capacity, and a leaked slot wedges the service for the
    * lifetime of the process.
    */
-  tryAcquire(): (() => void) | null {
-    if (this.saturated) return null;
-    this.active += 1;
-    let released = false;
-    return () => {
-      if (released) return;
-      released = true;
-      this.active -= 1;
-    };
-  }
+  tryAcquire(): (() => void) | null {}
 }
 
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected undefined to be null

[Killed] ConditionalExpression
src/limits/concurrency.ts:28:9
    * lifetime of the process.
    */
   tryAcquire(): (() => void) | null {
-    if (this.saturated) return null;
+    if (false) return null;
     this.active += 1;
     let released = false;
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected [Function] to be null

[Killed] ConditionalExpression
src/limits/concurrency.ts:28:9
    * lifetime of the process.
    */
   tryAcquire(): (() => void) | null {
-    if (this.saturated) return null;
+    if (true) return null;
     this.active += 1;
     let released = false;
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected null not to be null

[Killed] AssignmentOperator
src/limits/concurrency.ts:29:5
    */
   tryAcquire(): (() => void) | null {
     if (this.saturated) return null;
-    this.active += 1;
+    this.active -= 1;
     let released = false;
     return () => {
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected [Function] to be null

[Killed] BooleanLiteral
src/limits/concurrency.ts:30:20
   tryAcquire(): (() => void) | null {
     if (this.saturated) return null;
     this.active += 1;
-    let released = false;
+    let released = true;
     return () => {
       if (released) return;
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/limits/concurrency.ts:31:18
     if (this.saturated) return null;
     this.active += 1;
     let released = false;
-    return () => {
-      if (released) return;
-      released = true;
-      this.active -= 1;
-    };
+    return () => {};
   }
 }
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/limits/concurrency.ts:32:11
     this.active += 1;
     let released = false;
     return () => {
-      if (released) return;
+      if (false) return;
       released = true;
       this.active -= 1;
killedBy: ConcurrencyLimiter ignores a double release, so one caller cannot inflate capacity
statusReason: expected [Function] to be null

[Killed] ConditionalExpression
src/limits/concurrency.ts:32:11
     this.active += 1;
     let released = false;
     return () => {
-      if (released) return;
+      if (true) return;
       released = true;
       this.active -= 1;
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/limits/concurrency.ts:33:18
     let released = false;
     return () => {
       if (released) return;
-      released = true;
+      released = false;
       this.active -= 1;
     };
killedBy: ConcurrencyLimiter ignores a double release, so one caller cannot inflate capacity
statusReason: expected [Function] to be null

[Killed] AssignmentOperator
src/limits/concurrency.ts:34:7
     return () => {
       if (released) return;
       released = true;
-      this.active -= 1;
+      this.active += 1;
     };
   }
killedBy: ConcurrencyLimiter hands out at most `max` slots
statusReason: expected true to be false // Object.is equality
