[Killed] StringLiteral
src/auth.ts:20:31
 import type { Settings } from "./config.js";
 import { HttpError } from "./errors.js";
 
-export const REQUIRED_SCOPE = "execute:code";
+export const REQUIRED_SCOPE = "";
 
 export interface Principal {
killedBy: require_principal valid token passes and yields claims
statusReason: expected 403 to be 200 // Object.is equality

[NoCoverage] BlockStatement
src/auth.ts:32:48
 
 // One cached JWKS resolver per URL — mirrors the lru_cached PyJWKClient.
 const jwksCache = new Map<string, JWTVerifyGetKey>();
-function jwksFor(url: string): JWTVerifyGetKey {
-  let set = jwksCache.get(url);
-  if (!set) {
-    set = createRemoteJWKSet(new URL(url));
-    jwksCache.set(url, set);
-  }
-  return set;
-}
+function jwksFor(url: string): JWTVerifyGetKey {}
 
 function bearerToken(req: Request): string {

[NoCoverage] ConditionalExpression
src/auth.ts:34:7
 const jwksCache = new Map<string, JWTVerifyGetKey>();
 function jwksFor(url: string): JWTVerifyGetKey {
   let set = jwksCache.get(url);
-  if (!set) {
+  if (false) {
     set = createRemoteJWKSet(new URL(url));
     jwksCache.set(url, set);

[NoCoverage] BlockStatement
src/auth.ts:34:13
 const jwksCache = new Map<string, JWTVerifyGetKey>();
 function jwksFor(url: string): JWTVerifyGetKey {
   let set = jwksCache.get(url);
-  if (!set) {
-    set = createRemoteJWKSet(new URL(url));
-    jwksCache.set(url, set);
-  }
+  if (!set) {}
   return set;
 }

[NoCoverage] CallExpression
src/auth.ts:36:5
   let set = jwksCache.get(url);
   if (!set) {
     set = createRemoteJWKSet(new URL(url));
-    jwksCache.set(url, set);
+    ;
   }
   return set;

[Killed] BlockStatement
src/auth.ts:41:44
   return set;
 }
 
-function bearerToken(req: Request): string {
-  const header = req.get("authorization") ?? "";
-  const firstSpace = header.indexOf(" ");
-  const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
-  const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
-  if (scheme.toLowerCase() !== "bearer" || !token) {
-    throw new HttpError(401, "Missing or malformed Authorization header");
-  }
-  return token;
-}
+function bearerToken(req: Request): string {}
 
 function hasRequiredScope(claims: JWTPayload): boolean {
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] LogicalOperator
src/auth.ts:42:18
 }
 
 function bearerToken(req: Request): string {
-  const header = req.get("authorization") ?? "";
+  const header = req.get("authorization") && "";
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Survived] StringLiteral
src/auth.ts:42:46
 }
 
 function bearerToken(req: Request): string {
-  const header = req.get("authorization") ?? "";
+  const header = req.get("authorization") ?? "Stryker was here!";
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);

[Killed] MethodExpression
src/auth.ts:44:47
 function bearerToken(req: Request): string {
   const header = req.get("authorization") ?? "";
   const firstSpace = header.indexOf(" ");
-  const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
+  const scheme = firstSpace === -1 ? header : header;
   const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
   if (scheme.toLowerCase() !== "bearer" || !token) {
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:44:18
 function bearerToken(req: Request): string {
   const header = req.get("authorization") ?? "";
   const firstSpace = header.indexOf(" ");
-  const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
+  const scheme = true ? header : header.slice(0, firstSpace);
   const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
   if (scheme.toLowerCase() !== "bearer" || !token) {
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] EqualityOperator
src/auth.ts:45:17
   const header = req.get("authorization") ?? "";
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
-  const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
+  const token = firstSpace !== -1 ? "" : header.slice(firstSpace + 1).trim();
   if (scheme.toLowerCase() !== "bearer" || !token) {
     throw new HttpError(401, "Missing or malformed Authorization header");
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ArithmeticOperator
src/auth.ts:45:55
   const header = req.get("authorization") ?? "";
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
-  const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
+  const token = firstSpace === -1 ? "" : header.slice(firstSpace - 1).trim();
   if (scheme.toLowerCase() !== "bearer" || !token) {
     throw new HttpError(401, "Missing or malformed Authorization header");
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:46:7
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
   const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
-  if (scheme.toLowerCase() !== "bearer" || !token) {
+  if (true) {
     throw new HttpError(401, "Missing or malformed Authorization header");
   }
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] MethodExpression
src/auth.ts:46:7
   const firstSpace = header.indexOf(" ");
   const scheme = firstSpace === -1 ? header : header.slice(0, firstSpace);
   const token = firstSpace === -1 ? "" : header.slice(firstSpace + 1).trim();
-  if (scheme.toLowerCase() !== "bearer" || !token) {
+  if (scheme.toUpperCase() !== "bearer" || !token) {
     throw new HttpError(401, "Missing or malformed Authorization header");
   }
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] BlockStatement
src/auth.ts:52:56
   return token;
 }
 
-function hasRequiredScope(claims: JWTPayload): boolean {
-  const scope = claims.scope;
-  if (typeof scope === "string" && scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {
-    return true;
-  }
-  const perms = (claims as { permissions?: unknown }).permissions;
-  return Array.isArray(perms) && perms.includes(REQUIRED_SCOPE);
-}
+function hasRequiredScope(claims: JWTPayload): boolean {}
 
 /**
killedBy: require_principal valid token passes and yields claims
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
src/auth.ts:54:88
 
 function hasRequiredScope(claims: JWTPayload): boolean {
   const scope = claims.scope;
-  if (typeof scope === "string" && scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {
-    return true;
-  }
+  if (typeof scope === "string" && scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {}
   const perms = (claims as { permissions?: unknown }).permissions;
   return Array.isArray(perms) && perms.includes(REQUIRED_SCOPE);
killedBy: require_principal valid token passes and yields claims
statusReason: expected 403 to be 200 // Object.is equality

[Killed] LogicalOperator
src/auth.ts:54:7
 
 function hasRequiredScope(claims: JWTPayload): boolean {
   const scope = claims.scope;
-  if (typeof scope === "string" && scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {
+  if (typeof scope === "string" || scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {
     return true;
   }
killedBy: mutation coverage: mutant accepts, real gate rejects substring-scope hole caught
statusReason: expected 200 to be 403 // Object.is equality

[Killed] BooleanLiteral
src/auth.ts:55:12
 function hasRequiredScope(claims: JWTPayload): boolean {
   const scope = claims.scope;
   if (typeof scope === "string" && scope.trim().split(/\s+/).includes(REQUIRED_SCOPE)) {
-    return true;
+    return false;
   }
   const perms = (claims as { permissions?: unknown }).permissions;
killedBy: require_principal valid token passes and yields claims
statusReason: expected 403 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:58:10
     return true;
   }
   const perms = (claims as { permissions?: unknown }).permissions;
-  return Array.isArray(perms) && perms.includes(REQUIRED_SCOPE);
+  return true;
 }
 
killedBy: require_principal missing scope is 403
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:58:10
     return true;
   }
   const perms = (claims as { permissions?: unknown }).permissions;
-  return Array.isArray(perms) && perms.includes(REQUIRED_SCOPE);
+  return false;
 }
 
killedBy: require_principal scope via permissions array passes
statusReason: expected 403 to be 200 // Object.is equality

[Killed] BlockStatement
src/auth.ts:67:33
  */
 export function makeRequirePrincipal(settings: Settings, keyOverride?: KeyInput): RequestHandler {
   return async (req, res, next) => {
-    if (!settings.authRequired) {
-      res.locals.principal = { userId: null, tenantId: null } satisfies Principal;
-      next();
-      return;
-    }
+    if (!settings.authRequired) {}
     try {
       const token = bearerToken(req); // throws HttpError(401) if missing/malformed
killedBy: require_principal auth disabled allows anonymous
statusReason: expected 401 to be 200 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:67:9
  */
 export function makeRequirePrincipal(settings: Settings, keyOverride?: KeyInput): RequestHandler {
   return async (req, res, next) => {
-    if (!settings.authRequired) {
+    if (true) {
       res.locals.principal = { userId: null, tenantId: null } satisfies Principal;
       next();
killedBy: require_principal valid token passes and yields claims
statusReason: expected { user_id: null, tenant_id: null } to deeply equal { user_id: 'auth0|abc123', …(1) }

[Killed] ObjectLiteral
src/auth.ts:68:30
 export function makeRequirePrincipal(settings: Settings, keyOverride?: KeyInput): RequestHandler {
   return async (req, res, next) => {
     if (!settings.authRequired) {
-      res.locals.principal = { userId: null, tenantId: null } satisfies Principal;
+      res.locals.principal = {} satisfies Principal;
       next();
       return;
killedBy: require_principal auth disabled allows anonymous
statusReason: expected {} to deeply equal { user_id: null, tenant_id: null }

[Killed] CallExpression
src/auth.ts:69:7
   return async (req, res, next) => {
     if (!settings.authRequired) {
       res.locals.principal = { userId: null, tenantId: null } satisfies Principal;
-      next();
+      ;
       return;
     }
killedBy: require_principal auth disabled allows anonymous
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/auth.ts:72:9
       next();
       return;
     }
-    try {
-      const token = bearerToken(req); // throws HttpError(401) if missing/malformed
-      const key = keyOverride ?? jwksFor(settings.oidcJwksUrl);
-      const { payload } = await jwtVerify(token, key as JWTVerifyGetKey, {
-        issuer: settings.oidcIssuer,
-        audience: settings.oidcAudience,
-        algorithms: ["RS256"],
-        // `sub` is required, not optional: OIDC mandates it, and every downstream control is
-        // keyed on it. Without it a verified token yields userId null, which would drop the
-        // caller into the shared anonymous quota bucket — letting one such caller exhaust the
-        // allowance of every other, and defeating per-user isolation.
-        requiredClaims: ["exp", "iss", "aud", "sub"],
-      });
-      if (!hasRequiredScope(payload)) {
-        next(new HttpError(403, `Token is missing the required scope '${REQUIRED_SCOPE}'`));
-        return;
-      }
-      res.locals.principal = {
-        userId: payload.sub ?? null,
-        tenantId: (payload as { org_id?: string }).org_id ?? null,
-      } satisfies Principal;
-      next();
-    } catch (err) {
+    try {} catch (err) {
       // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
       if (err instanceof HttpError) {
killedBy: require_principal valid token passes and yields claims
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
src/auth.ts:74:19
     }
     try {
       const token = bearerToken(req); // throws HttpError(401) if missing/malformed
-      const key = keyOverride ?? jwksFor(settings.oidcJwksUrl);
+      const key = keyOverride && jwksFor(settings.oidcJwksUrl);
       const { payload } = await jwtVerify(token, key as JWTVerifyGetKey, {
         issuer: settings.oidcIssuer,
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Killed] StringLiteral
src/auth.ts:83:40
         // keyed on it. Without it a verified token yields userId null, which would drop the
         // caller into the shared anonymous quota bucket — letting one such caller exhaust the
         // allowance of every other, and defeating per-user isolation.
-        requiredClaims: ["exp", "iss", "aud", "sub"],
+        requiredClaims: ["exp", "iss", "", "sub"],
       });
       if (!hasRequiredScope(payload)) {
killedBy: require_principal valid token passes and yields claims
statusReason: expected 401 to be 200 // Object.is equality

[Survived] ArrayDeclaration
src/auth.ts:83:25
         // keyed on it. Without it a verified token yields userId null, which would drop the
         // caller into the shared anonymous quota bucket — letting one such caller exhaust the
         // allowance of every other, and defeating per-user isolation.
-        requiredClaims: ["exp", "iss", "aud", "sub"],
+        requiredClaims: [],
       });
       if (!hasRequiredScope(payload)) {

[Killed] BlockStatement
src/auth.ts:85:39
         // allowance of every other, and defeating per-user isolation.
         requiredClaims: ["exp", "iss", "aud", "sub"],
       });
-      if (!hasRequiredScope(payload)) {
-        next(new HttpError(403, `Token is missing the required scope '${REQUIRED_SCOPE}'`));
-        return;
-      }
+      if (!hasRequiredScope(payload)) {}
       res.locals.principal = {
         userId: payload.sub ?? null,
killedBy: require_principal missing scope is 403
statusReason: expected 200 to be 403 // Object.is equality

[Killed] ConditionalExpression
src/auth.ts:85:11
         // allowance of every other, and defeating per-user isolation.
         requiredClaims: ["exp", "iss", "aud", "sub"],
       });
-      if (!hasRequiredScope(payload)) {
+      if (true) {
         next(new HttpError(403, `Token is missing the required scope '${REQUIRED_SCOPE}'`));
         return;
killedBy: require_principal valid token passes and yields claims
statusReason: expected 403 to be 200 // Object.is equality

[Killed] LogicalOperator
src/auth.ts:90:17
         return;
       }
       res.locals.principal = {
-        userId: payload.sub ?? null,
+        userId: payload.sub && null,
         tenantId: (payload as { org_id?: string }).org_id ?? null,
       } satisfies Principal;
killedBy: require_principal valid token passes and yields claims
statusReason: expected { user_id: null, tenant_id: 'org_xyz' } to deeply equal { user_id: 'auth0|abc123', …(1) }

[Killed] LogicalOperator
src/auth.ts:91:19
       }
       res.locals.principal = {
         userId: payload.sub ?? null,
-        tenantId: (payload as { org_id?: string }).org_id ?? null,
+        tenantId: (payload as {
+  org_id?: string;
+}).org_id && null,
       } satisfies Principal;
       next();
killedBy: require_principal valid token passes and yields claims
statusReason: expected { user_id: 'auth0|abc123', …(1) } to deeply equal { user_id: 'auth0|abc123', …(1) }

[Killed] CallExpression
src/auth.ts:93:7
         userId: payload.sub ?? null,
         tenantId: (payload as { org_id?: string }).org_id ?? null,
       } satisfies Principal;
-      next();
+      ;
     } catch (err) {
       // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
killedBy: require_principal valid token passes and yields claims
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/auth.ts:94:19
         tenantId: (payload as { org_id?: string }).org_id ?? null,
       } satisfies Principal;
       next();
-    } catch (err) {
-      // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
-      if (err instanceof HttpError) {
-        next(err);
-        return;
-      }
-      next(new HttpError(401, "Invalid authentication token"));
-    }
+    } catch (err) {}
   };
 }
killedBy: require_principal bad signature is 401
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/auth.ts:96:11
       next();
     } catch (err) {
       // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
-      if (err instanceof HttpError) {
+      if (true) {
         next(err);
         return;
killedBy: require_principal bad signature is 401
statusReason: expected 500 to be 401 // Object.is equality

[Survived] ConditionalExpression
src/auth.ts:96:11
       next();
     } catch (err) {
       // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
-      if (err instanceof HttpError) {
+      if (false) {
         next(err);
         return;

[Killed] CallExpression
src/auth.ts:97:9
     } catch (err) {
       // A missing-header HttpError is already a 401; any jose failure maps to 401 too.
       if (err instanceof HttpError) {
-        next(err);
+        ;
         return;
       }
killedBy: require_principal missing header is 401
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
