[Killed] ObjectLiteral
src/sandbox/cloudRunSandbox.ts:35:48
 // code actually runs, which is the most expensive place to find out.
 const PYTHON = "/usr/bin/python3";
 
-const LANG_RUNNERS: Record<string, string[]> = {
-  python: [PYTHON, "-I", "-B", "-c"],
-};
+const LANG_RUNNERS: Record<string, string[]> = {};
 
 /** Renders a capped buffer plus however many characters were thrown away while capping. */
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected 2 to be +0 // Object.is equality

[Survived] StringLiteral
src/sandbox/cloudRunSandbox.ts:36:32
 const PYTHON = "/usr/bin/python3";
 
 const LANG_RUNNERS: Record<string, string[]> = {
-  python: [PYTHON, "-I", "-B", "-c"],
+  python: [PYTHON, "-I", "-B", ""],
 };
 

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:40:58
 };
 
 /** Renders a capped buffer plus however many characters were thrown away while capping. */
-function rendered(kept: string, dropped: number): string {
-  return dropped === 0 ? kept : `${kept}\n…[truncated, ${dropped} more chars]`;
-}
+function rendered(kept: string, dropped: number): string {}
 
 export class CloudRunSandboxBackend implements SandboxBackend {
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] EqualityOperator
src/sandbox/cloudRunSandbox.ts:41:10
 
 /** Renders a capped buffer plus however many characters were thrown away while capping. */
 function rendered(kept: string, dropped: number): string {
-  return dropped === 0 ? kept : `${kept}\n…[truncated, ${dropped} more chars]`;
+  return dropped !== 0 ? kept : `${kept}\n…[truncated, ${dropped} more chars]`;
 }
 
killedBy: CloudRunSandboxBackend truncates output past maxOutputChars
statusReason: expected 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'truncated'

[Killed] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:41:10
 
 /** Renders a capped buffer plus however many characters were thrown away while capping. */
 function rendered(kept: string, dropped: number): string {
-  return dropped === 0 ? kept : `${kept}\n…[truncated, ${dropped} more chars]`;
+  return true ? kept : `${kept}\n…[truncated, ${dropped} more chars]`;
 }
 
killedBy: CloudRunSandboxBackend truncates output past maxOutputChars
statusReason: expected 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'truncated'

[Killed] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:49:9
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
     const runner = LANG_RUNNERS[language];
-    if (!runner) {
+    if (true) {
       return {
         stdout: "",
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected 2 to be +0 // Object.is equality

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:49:18
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
     const runner = LANG_RUNNERS[language];
-    if (!runner) {
-      return {
-        stdout: "",
-        stderr: `Unsupported language: '${language}'`,
-        exitCode: 2,
-        durationMs: 0,
-        timedOut: false,
-      };
-    }
+    if (!runner) {}
 
     // --write gives the sandbox a tmpfs overlay to write into; the base filesystem stays
killedBy: CloudRunSandboxBackend rejects an unsupported language without spawning anything
statusReason: runner is not iterable

[Survived] StringLiteral
src/sandbox/cloudRunSandbox.ts:51:17
     const runner = LANG_RUNNERS[language];
     if (!runner) {
       return {
-        stdout: "",
+        stdout: "Stryker was here!",
         stderr: `Unsupported language: '${language}'`,
         exitCode: 2,

[Survived] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:55:19
         stderr: `Unsupported language: '${language}'`,
         exitCode: 2,
         durationMs: 0,
-        timedOut: false,
+        timedOut: true,
       };
     }

[Killed] ArrayDeclaration
src/sandbox/cloudRunSandbox.ts:64:18
     // backend match `--network none`, and passing it once would silently undo the isolation the
     // README claims. The code travels as a single argv element with no shell involved, so there
     // is no quoting or injection surface.
-    const args = ["do", "--write", "--", ...runner, code];
+    const args = [];
 
     const started = process.hrtime.bigint();
killedBy: CloudRunSandboxBackend never passes --allow-egress: deny-by-default is the whole point
statusReason: expected '\n' to contain '--write'

[Survived] StringLiteral
src/sandbox/cloudRunSandbox.ts:64:36
     // backend match `--network none`, and passing it once would silently undo the isolation the
     // README claims. The code travels as a single argv element with no shell involved, so there
     // is no quoting or injection surface.
-    const args = ["do", "--write", "--", ...runner, code];
+    const args = ["do", "--write", "", ...runner, code];
 
     const started = process.hrtime.bigint();

[Killed] StringLiteral
src/sandbox/cloudRunSandbox.ts:74:27
       // own: the timeout would bound nothing and ConcurrencyLimitedBackend would never release
       // the slot. Those two are the only controls left after D7, so this is load-bearing.
       const child = spawn(this.cliPath, args, {
-        stdio: ["ignore", "pipe", "pipe"],
+        stdio: ["ignore", "", "pipe"],
         detached: true,
       });
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Asynchronous forks do not support Buffer, TypedArray, DataView or string input: ''

[Killed] StringLiteral
src/sandbox/cloudRunSandbox.ts:74:35
       // own: the timeout would bound nothing and ConcurrencyLimitedBackend would never release
       // the slot. Those two are the only controls left after D7, so this is load-bearing.
       const child = spawn(this.cliPath, args, {
-        stdio: ["ignore", "pipe", "pipe"],
+        stdio: ["ignore", "pipe", ""],
         detached: true,
       });
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Asynchronous forks do not support Buffer, TypedArray, DataView or string input: ''

[Survived] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:75:19
       // the slot. Those two are the only controls left after D7, so this is load-bearing.
       const child = spawn(this.cliPath, args, {
         stdio: ["ignore", "pipe", "pipe"],
-        detached: true,
+        detached: false,
       });
       let timedOut = false;

[Killed] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:77:22
         stdio: ["ignore", "pipe", "pipe"],
         detached: true,
       });
-      let timedOut = false;
+      let timedOut = true;
       let settled = false;
 
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected 124 to be +0 // Object.is equality

[Killed] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:78:21
         detached: true,
       });
       let timedOut = false;
-      let settled = false;
+      let settled = true;
 
       // Bound what is RETAINED, not merely what is reported. Accumulating without limit and
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/sandbox/cloudRunSandbox.ts:91:7
       let stdoutDropped = 0;
       let stderrDropped = 0;
 
-      child.stdout.on("data", (c: Buffer) => {
-        const chunk = c.toString();
-        const room = Math.max(0, cap - stdout.length);
-        if (room > 0) stdout += chunk.slice(0, room);
-        stdoutDropped += chunk.length - Math.min(room, chunk.length);
-      });
+      ;
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected '' to contain 'hello from the sandbox'

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:91:46
       let stdoutDropped = 0;
       let stderrDropped = 0;
 
-      child.stdout.on("data", (c: Buffer) => {
-        const chunk = c.toString();
-        const room = Math.max(0, cap - stdout.length);
-        if (room > 0) stdout += chunk.slice(0, room);
-        stdoutDropped += chunk.length - Math.min(room, chunk.length);
-      });
+      child.stdout.on("data", (c: Buffer) => {});
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected '' to contain 'hello from the sandbox'

[Killed] MethodExpression
src/sandbox/cloudRunSandbox.ts:93:22
 
       child.stdout.on("data", (c: Buffer) => {
         const chunk = c.toString();
-        const room = Math.max(0, cap - stdout.length);
+        const room = Math.min(0, cap - stdout.length);
         if (room > 0) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected '\n…[truncated, 23 more chars]' to contain 'hello from the sandbox'

[Killed] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:93:34
 
       child.stdout.on("data", (c: Buffer) => {
         const chunk = c.toString();
-        const room = Math.max(0, cap - stdout.length);
+        const room = Math.max(0, cap + stdout.length);
         if (room > 0) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
killedBy: CloudRunSandboxBackend truncates output past maxOutputChars
statusReason: expected 500 to be less than 300

[Killed] EqualityOperator
src/sandbox/cloudRunSandbox.ts:94:13
       child.stdout.on("data", (c: Buffer) => {
         const chunk = c.toString();
         const room = Math.max(0, cap - stdout.length);
-        if (room > 0) stdout += chunk.slice(0, room);
+        if (room <= 0) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
       });
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected '' to contain 'hello from the sandbox'

[Killed] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:94:13
       child.stdout.on("data", (c: Buffer) => {
         const chunk = c.toString();
         const room = Math.max(0, cap - stdout.length);
-        if (room > 0) stdout += chunk.slice(0, room);
+        if (false) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
       });
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected '' to contain 'hello from the sandbox'

[Killed] MethodExpression
src/sandbox/cloudRunSandbox.ts:95:41
         const chunk = c.toString();
         const room = Math.max(0, cap - stdout.length);
         if (room > 0) stdout += chunk.slice(0, room);
-        stdoutDropped += chunk.length - Math.min(room, chunk.length);
+        stdoutDropped += chunk.length - Math.max(room, chunk.length);
       });
       child.stderr.on("data", (c: Buffer) => {
killedBy: CloudRunSandboxBackend retains only maxOutputChars while a payload floods stdout
statusReason: expected 'xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx…' to contain 'truncated'

[Survived] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:95:26
         const chunk = c.toString();
         const room = Math.max(0, cap - stdout.length);
         if (room > 0) stdout += chunk.slice(0, room);
-        stdoutDropped += chunk.length - Math.min(room, chunk.length);
+        stdoutDropped += chunk.length + Math.min(room, chunk.length);
       });
       child.stderr.on("data", (c: Buffer) => {

[Killed] CallExpression
src/sandbox/cloudRunSandbox.ts:97:7
         if (room > 0) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
       });
-      child.stderr.on("data", (c: Buffer) => {
-        const chunk = c.toString();
-        const room = Math.max(0, cap - stderr.length);
-        if (room > 0) stderr += chunk.slice(0, room);
-        stderrDropped += chunk.length - Math.min(room, chunk.length);
-      });
+      ;
 
       const finish = (exitCode: number): void => {
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected '' to contain 'boom'

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:97:46
         if (room > 0) stdout += chunk.slice(0, room);
         stdoutDropped += chunk.length - Math.min(room, chunk.length);
       });
-      child.stderr.on("data", (c: Buffer) => {
-        const chunk = c.toString();
-        const room = Math.max(0, cap - stderr.length);
-        if (room > 0) stderr += chunk.slice(0, room);
-        stderrDropped += chunk.length - Math.min(room, chunk.length);
-      });
+      child.stderr.on("data", (c: Buffer) => {});
 
       const finish = (exitCode: number): void => {
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected '' to contain 'boom'

[Killed] MethodExpression
src/sandbox/cloudRunSandbox.ts:99:22
       });
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
-        const room = Math.max(0, cap - stderr.length);
+        const room = Math.min(0, cap - stderr.length);
         if (room > 0) stderr += chunk.slice(0, room);
         stderrDropped += chunk.length - Math.min(room, chunk.length);
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected '\n…[truncated, 5 more chars]' to contain 'boom'

[Survived] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:99:34
       });
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
-        const room = Math.max(0, cap - stderr.length);
+        const room = Math.max(0, cap + stderr.length);
         if (room > 0) stderr += chunk.slice(0, room);
         stderrDropped += chunk.length - Math.min(room, chunk.length);

[Killed] EqualityOperator
src/sandbox/cloudRunSandbox.ts:100:13
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
         const room = Math.max(0, cap - stderr.length);
-        if (room > 0) stderr += chunk.slice(0, room);
+        if (room <= 0) stderr += chunk.slice(0, room);
         stderrDropped += chunk.length - Math.min(room, chunk.length);
       });
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected '' to contain 'boom'

[Killed] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:100:13
       child.stderr.on("data", (c: Buffer) => {
         const chunk = c.toString();
         const room = Math.max(0, cap - stderr.length);
-        if (room > 0) stderr += chunk.slice(0, room);
+        if (false) stderr += chunk.slice(0, room);
         stderrDropped += chunk.length - Math.min(room, chunk.length);
       });
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected '' to contain 'boom'

[Survived] AssignmentOperator
src/sandbox/cloudRunSandbox.ts:101:9
         const chunk = c.toString();
         const room = Math.max(0, cap - stderr.length);
         if (room > 0) stderr += chunk.slice(0, room);
-        stderrDropped += chunk.length - Math.min(room, chunk.length);
+        stderrDropped -= chunk.length - Math.min(room, chunk.length);
       });
 

[Survived] MethodExpression
src/sandbox/cloudRunSandbox.ts:101:41
         const chunk = c.toString();
         const room = Math.max(0, cap - stderr.length);
         if (room > 0) stderr += chunk.slice(0, room);
-        stderrDropped += chunk.length - Math.min(room, chunk.length);
+        stderrDropped += chunk.length - Math.max(room, chunk.length);
       });
 

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:104:50
         stderrDropped += chunk.length - Math.min(room, chunk.length);
       });
 
-      const finish = (exitCode: number): void => {
-        if (settled) return;
-        settled = true;
-        clearTimeout(timer);
-        resolve({
-          stdout: rendered(stdout, stdoutDropped),
-          stderr: rendered(stderr, stderrDropped),
-          exitCode,
-          durationMs: Number((process.hrtime.bigint() - started) / 1_000_000n),
-          timedOut,
-        });
-      };
+      const finish = (exitCode: number): void => {};
 
       const timer = setTimeout(() => {
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:105:13
       });
 
       const finish = (exitCode: number): void => {
-        if (settled) return;
+        if (true) return;
         settled = true;
         clearTimeout(timer);
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ConditionalExpression
src/sandbox/cloudRunSandbox.ts:105:13
       });
 
       const finish = (exitCode: number): void => {
-        if (settled) return;
+        if (false) return;
         settled = true;
         clearTimeout(timer);

[Survived] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:106:19
 
       const finish = (exitCode: number): void => {
         if (settled) return;
-        settled = true;
+        settled = false;
         clearTimeout(timer);
         resolve({

[Survived] CallExpression
src/sandbox/cloudRunSandbox.ts:107:9
       const finish = (exitCode: number): void => {
         if (settled) return;
         settled = true;
-        clearTimeout(timer);
+        ;
         resolve({
           stdout: rendered(stdout, stdoutDropped),

[Killed] ObjectLiteral
src/sandbox/cloudRunSandbox.ts:108:17
         if (settled) return;
         settled = true;
         clearTimeout(timer);
-        resolve({
-          stdout: rendered(stdout, stdoutDropped),
-          stderr: rendered(stderr, stderrDropped),
-          exitCode,
-          durationMs: Number((process.hrtime.bigint() - started) / 1_000_000n),
-          timedOut,
-        });
+        resolve({});
       };
 
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected undefined to be +0 // Object.is equality

[Survived] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:112:30
           stdout: rendered(stdout, stdoutDropped),
           stderr: rendered(stderr, stderrDropped),
           exitCode,
-          durationMs: Number((process.hrtime.bigint() - started) / 1_000_000n),
+          durationMs: Number((process.hrtime.bigint() - started) * 1_000_000n),
           timedOut,
         });

[Survived] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:112:31
           stdout: rendered(stdout, stdoutDropped),
           stderr: rendered(stderr, stderrDropped),
           exitCode,
-          durationMs: Number((process.hrtime.bigint() - started) / 1_000_000n),
+          durationMs: Number((process.hrtime.bigint() + started) / 1_000_000n),
           timedOut,
         });

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:117:38
         });
       };
 
-      const timer = setTimeout(() => {
-        timedOut = true;
-        // SIGKILL to the whole GROUP: the payload is untrusted and under no obligation to handle
-        // a signal politely, and the interpreter is a grandchild.
-        try {
-          process.kill(-(child.pid as number), "SIGKILL");
-        } catch {
-          child.kill("SIGKILL"); // already gone
-        }
-      }, limits.timeoutSeconds * 1000);
+      const timer = setTimeout(() => {}, limits.timeoutSeconds * 1000);
 
       child.on("error", (err) => {
killedBy: CloudRunSandboxBackend kills a run that outlives the timeout and says so
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/sandbox/cloudRunSandbox.ts:118:20
       };
 
       const timer = setTimeout(() => {
-        timedOut = true;
+        timedOut = false;
         // SIGKILL to the whole GROUP: the payload is untrusted and under no obligation to handle
         // a signal politely, and the interpreter is a grandchild.
killedBy: CloudRunSandboxBackend kills a run that outlives the timeout and says so
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:121:13
         timedOut = true;
         // SIGKILL to the whole GROUP: the payload is untrusted and under no obligation to handle
         // a signal politely, and the interpreter is a grandchild.
-        try {
-          process.kill(-(child.pid as number), "SIGKILL");
-        } catch {
+        try {} catch {
           child.kill("SIGKILL"); // already gone
         }
killedBy: CloudRunSandboxBackend kills a run that outlives the timeout and says so
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/sandbox/cloudRunSandbox.ts:122:11
         // SIGKILL to the whole GROUP: the payload is untrusted and under no obligation to handle
         // a signal politely, and the interpreter is a grandchild.
         try {
-          process.kill(-(child.pid as number), "SIGKILL");
+          ;
         } catch {
           child.kill("SIGKILL"); // already gone
killedBy: CloudRunSandboxBackend kills a run that outlives the timeout and says so
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] UnaryOperator
src/sandbox/cloudRunSandbox.ts:122:24
         // SIGKILL to the whole GROUP: the payload is untrusted and under no obligation to handle
         // a signal politely, and the interpreter is a grandchild.
         try {
-          process.kill(-(child.pid as number), "SIGKILL");
+          process.kill(+(child.pid as number), "SIGKILL");
         } catch {
           child.kill("SIGKILL"); // already gone

[NoCoverage] BlockStatement
src/sandbox/cloudRunSandbox.ts:123:17
         // a signal politely, and the interpreter is a grandchild.
         try {
           process.kill(-(child.pid as number), "SIGKILL");
-        } catch {
-          child.kill("SIGKILL"); // already gone
-        }
+        } catch {}
       }, limits.timeoutSeconds * 1000);
 

[NoCoverage] StringLiteral
src/sandbox/cloudRunSandbox.ts:124:22
         try {
           process.kill(-(child.pid as number), "SIGKILL");
         } catch {
-          child.kill("SIGKILL"); // already gone
+          child.kill(""); // already gone
         }
       }, limits.timeoutSeconds * 1000);

[Killed] ArithmeticOperator
src/sandbox/cloudRunSandbox.ts:126:10
         } catch {
           child.kill("SIGKILL"); // already gone
         }
-      }, limits.timeoutSeconds * 1000);
+      }, limits.timeoutSeconds / 1000);
 
       child.on("error", (err) => {
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: expected 124 to be +0 // Object.is equality

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:128:34
         }
       }, limits.timeoutSeconds * 1000);
 
-      child.on("error", (err) => {
-        // The CLI is missing or not executable — infrastructure, not a program failure. Reported
-        // as a result rather than a rejection so the base contract holds, but logged at error
-        // level: it means the service was deployed without --sandbox-launcher.
-        log.error("sandbox CLI could not be spawned", { err, cli: this.cliPath });
-        stderr = `${stderr}\nsandbox CLI unavailable at ${this.cliPath}`;
-        finish(126);
-      });
+      child.on("error", (err) => {});
 
       // 'exit', not 'close': exit fires when the process ends, close waits for every pipe to
killedBy: CloudRunSandboxBackend reports a missing CLI as an infrastructure fault, not a program failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] CallExpression
src/sandbox/cloudRunSandbox.ts:134:9
         // level: it means the service was deployed without --sandbox-launcher.
         log.error("sandbox CLI could not be spawned", { err, cli: this.cliPath });
         stderr = `${stderr}\nsandbox CLI unavailable at ${this.cliPath}`;
-        finish(126);
+        ;
       });
 
killedBy: CloudRunSandboxBackend reports a missing CLI as an infrastructure fault, not a program failure
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/sandbox/cloudRunSandbox.ts:140:34
       // 'exit', not 'close': exit fires when the process ends, close waits for every pipe to
       // drain — including one a killed grandchild may still hold. Give the streams a bounded
       // moment to flush, the same shape as dockerBackend's Promise.race([streamEnded, delay]).
-      child.on("exit", (code) => {
-        // Disarm FIRST. The 200ms flush below is a window in which the deadline could otherwise
-        // still fire, flip timedOut, and turn a run that finished successfully a few milliseconds
-        // early into a reported timeout with exit 124.
-        clearTimeout(timer);
-        const exitCode = timedOut ? 124 : (code ?? 1);
-        const flush = setTimeout(() => finish(exitCode), 200);
-        flush.unref?.();
-      });
+      child.on("exit", (code) => {});
     });
   }
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] CallExpression
src/sandbox/cloudRunSandbox.ts:144:9
         // Disarm FIRST. The 200ms flush below is a window in which the deadline could otherwise
         // still fire, flip timedOut, and turn a run that finished successfully a few milliseconds
         // early into a reported timeout with exit 124.
-        clearTimeout(timer);
+        ;
         const exitCode = timedOut ? 124 : (code ?? 1);
         const flush = setTimeout(() => finish(exitCode), 200);

[Killed] LogicalOperator
src/sandbox/cloudRunSandbox.ts:145:44
         // still fire, flip timedOut, and turn a run that finished successfully a few milliseconds
         // early into a reported timeout with exit 124.
         clearTimeout(timer);
-        const exitCode = timedOut ? 124 : (code ?? 1);
+        const exitCode = timedOut ? 124 : (code && 1);
         const flush = setTimeout(() => finish(exitCode), 200);
         flush.unref?.();
killedBy: CloudRunSandboxBackend reports a non-zero exit without rejecting
statusReason: expected 1 to be 3 // Object.is equality

[Killed] ArrowFunction
src/sandbox/cloudRunSandbox.ts:146:34
         // early into a reported timeout with exit 124.
         clearTimeout(timer);
         const exitCode = timedOut ? 124 : (code ?? 1);
-        const flush = setTimeout(() => finish(exitCode), 200);
+        const flush = setTimeout(() => undefined, 200);
         flush.unref?.();
       });
killedBy: CloudRunSandboxBackend runs code and returns stdout with exit code 0
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] OptionalChaining
src/sandbox/cloudRunSandbox.ts:147:9
         clearTimeout(timer);
         const exitCode = timedOut ? 124 : (code ?? 1);
         const flush = setTimeout(() => finish(exitCode), 200);
-        flush.unref?.();
+        flush.unref();
       });
     });
