[Killed] BlockStatement
src/limits/middleware.ts:26:11
     const principal = (res.locals.principal ?? { userId: null }) as Principal;
     void (async () => {
       let decision;
-      try {
-        decision = await store.consume(quotaKey(principal.userId), limits);
-      } catch (err) {
+      try {} catch (err) {
         // FAIL OPEN (D5). The in-process sandbox concurrency cap still bounds the host, so an
         // outage degrades protection rather than removing it — the exposure narrows to
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/limits/middleware.ts:28:21
       let decision;
       try {
         decision = await store.consume(quotaKey(principal.userId), limits);
-      } catch (err) {
-        // FAIL OPEN (D5). The in-process sandbox concurrency cap still bounds the host, so an
-        // outage degrades protection rather than removing it — the exposure narrows to
-        // Anthropic spend for its duration. That is precisely why this logs at error level:
-        // S9 treats silence here as a defect, because this line is the only thing standing
-        // between a Redis outage and an unbounded bill.
-        log.error("quota store unavailable — FAILING OPEN, requests are unmetered", { err });
-        next();
-        return;
-      }
+      } catch (err) {}
       if (decision.allowed) {
         next();
killedBy: quota middleware fails OPEN when the store throws, and says so loudly (D5, S9)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] ObjectLiteral
src/limits/middleware.ts:34:85
         // Anthropic spend for its duration. That is precisely why this logs at error level:
         // S9 treats silence here as a defect, because this line is the only thing standing
         // between a Redis outage and an unbounded bill.
-        log.error("quota store unavailable — FAILING OPEN, requests are unmetered", { err });
+        log.error("quota store unavailable — FAILING OPEN, requests are unmetered", {});
         next();
         return;

[Killed] CallExpression
src/limits/middleware.ts:35:9
         // S9 treats silence here as a defect, because this line is the only thing standing
         // between a Redis outage and an unbounded bill.
         log.error("quota store unavailable — FAILING OPEN, requests are unmetered", { err });
-        next();
+        ;
         return;
       }
killedBy: quota middleware fails OPEN when the store throws, and says so loudly (D5, S9)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/limits/middleware.ts:38:29
         next();
         return;
       }
-      if (decision.allowed) {
-        next();
-        return;
-      }
+      if (decision.allowed) {}
       next(
         new HttpError(
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 "OK", got 429 "Too Many Requests"

[Killed] ConditionalExpression
src/limits/middleware.ts:38:11
         next();
         return;
       }
-      if (decision.allowed) {
+      if (true) {
         next();
         return;
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 to be 429 // Object.is equality

[Killed] CallExpression
src/limits/middleware.ts:39:9
         return;
       }
       if (decision.allowed) {
-        next();
+        ;
         return;
       }
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
src/limits/middleware.ts:45:11
       next(
         new HttpError(
           429,
-          "Rate limit exceeded. Please wait before sending another request.",
+          "",
           decision.retryAfterSeconds,
         ),
