[Killed] MethodExpression
src/schemas.ts:8:11
 // tenant_id / user_id are intentionally NOT request fields; they are derived
 // server-side from the verified token (see auth.ts) so they cannot be spoofed.
 export const ExecuteRequest = z.object({
-  prompt: z.string().min(1).max(8000),
+  prompt: z.string().max(1).max(8000),
   session_id: z.string().uuid().optional(), // continue an existing session; omit to start one
 });
killedBy: POST /api/execute happy path returns the exact result wire shape and runs the sandbox once
statusReason: expected 422 to be 200 // Object.is equality

[Killed] MethodExpression
src/schemas.ts:8:11
 // tenant_id / user_id are intentionally NOT request fields; they are derived
 // server-side from the verified token (see auth.ts) so they cannot be spoofed.
 export const ExecuteRequest = z.object({
-  prompt: z.string().min(1).max(8000),
+  prompt: z.string().min(1).min(8000),
   session_id: z.string().uuid().optional(), // continue an existing session; omit to start one
 });
killedBy: isolation battery: memory INV-4 execute with another user's session_id → 404, victim untouched, sandbox unrun
statusReason: expected 422 to be 404 // Object.is equality

[Killed] ArrowFunction
src/schemas.ts:35:23
 // for an authenticated caller (both present, or neither). Anonymous / history-off omits them,
 // keeping the response byte-identical to the pre-history contract.
 type Persisted = { sessionId?: string; runId?: string };
-const persistedWire = (p?: Persisted) =>
-  p?.sessionId && p?.runId ? { session_id: p.sessionId, run_id: p.runId } : {};
+const persistedWire = () => undefined;
 
 export function messageResponse(message: string, p?: Persisted) {
killedBy: retry hints omits Retry-After when the error carries no hint
statusReason: expected 404 to be 503 // Object.is equality

[Killed] ConditionalExpression
src/schemas.ts:36:3
 // keeping the response byte-identical to the pre-history contract.
 type Persisted = { sessionId?: string; runId?: string };
 const persistedWire = (p?: Persisted) =>
-  p?.sessionId && p?.runId ? { session_id: p.sessionId, run_id: p.runId } : {};
+  false ? { session_id: p.sessionId, run_id: p.runId } : {};
 
 export function messageResponse(message: string, p?: Persisted) {
killedBy: POST /api/execute — persist on execute (a) authenticated execute persists a run and returns session_id + run_id
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] OptionalChaining
src/schemas.ts:36:3
 // keeping the response byte-identical to the pre-history contract.
 type Persisted = { sessionId?: string; runId?: string };
 const persistedWire = (p?: Persisted) =>
-  p?.sessionId && p?.runId ? { session_id: p.sessionId, run_id: p.runId } : {};
+  p.sessionId && p?.runId ? { session_id: p.sessionId, run_id: p.runId } : {};
 
 export function messageResponse(message: string, p?: Persisted) {
killedBy: isolation battery: memory INV-6 anonymous: history routes 404, execute persists nothing
statusReason: expected 500 to be 200 // Object.is equality

[Killed] BlockStatement
src/schemas.ts:38:65
 const persistedWire = (p?: Persisted) =>
   p?.sessionId && p?.runId ? { session_id: p.sessionId, run_id: p.runId } : {};
 
-export function messageResponse(message: string, p?: Persisted) {
-  return { type: "message" as const, message, ...persistedWire(p) };
-}
+export function messageResponse(message: string, p?: Persisted) {}
 
 export function resultResponse(language: string, code: string, r: SandboxResult, p?: Persisted) {
killedBy: POST /api/execute no-code path returns a message and never touches the sandbox
statusReason: expected '' to deeply equal { type: 'message', …(1) }

[Killed] BlockStatement
src/schemas.ts:42:97
   return { type: "message" as const, message, ...persistedWire(p) };
 }
 
-export function resultResponse(language: string, code: string, r: SandboxResult, p?: Persisted) {
-  return {
-    type: "result" as const,
-    language,
-    code,
-    stdout: r.stdout,
-    stderr: r.stderr,
-    exit_code: r.exitCode,
-    duration_ms: r.durationMs,
-    timed_out: r.timedOut,
-    ...persistedWire(p),
-  };
-}
+export function resultResponse(language: string, code: string, r: SandboxResult, p?: Persisted) {}
 
killedBy: sandbox backend selection through createApp routes execution to the Cloud Run backend when SANDBOX_BACKEND=cloudrun
statusReason: expected undefined to be 126 // Object.is equality

[Killed] ObjectLiteral
src/schemas.ts:43:10
 }
 
 export function resultResponse(language: string, code: string, r: SandboxResult, p?: Persisted) {
-  return {
-    type: "result" as const,
-    language,
-    code,
-    stdout: r.stdout,
-    stderr: r.stderr,
-    exit_code: r.exitCode,
-    duration_ms: r.durationMs,
-    timed_out: r.timedOut,
-    ...persistedWire(p),
-  };
+  return {};
 }
 
killedBy: POST /api/execute happy path returns the exact result wire shape and runs the sandbox once
statusReason: expected {} to deeply equal { type: 'result', …(7) }
