[Survived] StringLiteral
src/sandbox/dockerBackend.ts:21:23
 import type { SandboxResult } from "../schemas.js";
 
 const LANG_RUNNERS: Record<string, { filename: string; cmd: string[] }> = {
-  python: { filename: "code.py", cmd: ["python", "-I", "-B", "/sandbox/code.py"] },
+  python: { filename: "", cmd: ["python", "-I", "-B", "/sandbox/code.py"] },
 };
 const WORKDIR = "/sandbox";

[Survived] StringLiteral
src/sandbox/dockerBackend.ts:21:56
 import type { SandboxResult } from "../schemas.js";
 
 const LANG_RUNNERS: Record<string, { filename: string; cmd: string[] }> = {
-  python: { filename: "code.py", cmd: ["python", "-I", "-B", "/sandbox/code.py"] },
+  python: { filename: "code.py", cmd: ["python", "-I", "", "/sandbox/code.py"] },
 };
 const WORKDIR = "/sandbox";

[Survived] ArrowFunction
src/sandbox/dockerBackend.ts:25:15
 };
 const WORKDIR = "/sandbox";
 
-const delay = (ms: number) => new Promise((r) => setTimeout(r, ms));
+const delay = () => undefined;
 const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
 

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:25:43
 };
 const WORKDIR = "/sandbox";
 
-const delay = (ms: number) => new Promise((r) => setTimeout(r, ms));
+const delay = (ms: number) => new Promise(() => undefined);
 const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
 

[Survived] ArrowFunction
src/sandbox/dockerBackend.ts:26:19
 const WORKDIR = "/sandbox";
 
 const delay = (ms: number) => new Promise((r) => setTimeout(r, ms));
-const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
+const elapsedMs = () => undefined;
 
 function truncate(text: string, limit: number): string {

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:26:46
 const WORKDIR = "/sandbox";
 
 const delay = (ms: number) => new Promise((r) => setTimeout(r, ms));
-const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
+const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() + start) / 1_000_000n);
 
 function truncate(text: string, limit: number): string {

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:28:56
 const delay = (ms: number) => new Promise((r) => setTimeout(r, ms));
 const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
 
-function truncate(text: string, limit: number): string {
-  if (text.length <= limit) return text;
-  return `${text.slice(0, limit)}\n…[truncated, ${text.length - limit} more chars]`;
-}
+function truncate(text: string, limit: number): string {}
 
 export class DockerBackend implements SandboxBackend {

[NoCoverage] ConditionalExpression
src/sandbox/dockerBackend.ts:29:7
 const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
 
 function truncate(text: string, limit: number): string {
-  if (text.length <= limit) return text;
+  if (false) return text;
   return `${text.slice(0, limit)}\n…[truncated, ${text.length - limit} more chars]`;
 }

[NoCoverage] EqualityOperator
src/sandbox/dockerBackend.ts:29:7
 const elapsedMs = (start: bigint) => Number((process.hrtime.bigint() - start) / 1_000_000n);
 
 function truncate(text: string, limit: number): string {
-  if (text.length <= limit) return text;
+  if (text.length > limit) return text;
   return `${text.slice(0, limit)}\n…[truncated, ${text.length - limit} more chars]`;
 }

[NoCoverage] ArithmeticOperator
src/sandbox/dockerBackend.ts:30:51
 
 function truncate(text: string, limit: number): string {
   if (text.length <= limit) return text;
-  return `${text.slice(0, limit)}\n…[truncated, ${text.length - limit} more chars]`;
+  return `${text.slice(0, limit)}\n…[truncated, ${text.length + limit} more chars]`;
 }
 

[NoCoverage] MethodExpression
src/sandbox/dockerBackend.ts:30:13
 
 function truncate(text: string, limit: number): string {
   if (text.length <= limit) return text;
-  return `${text.slice(0, limit)}\n…[truncated, ${text.length - limit} more chars]`;
+  return `${text}\n…[truncated, ${text.length - limit} more chars]`;
 }
 

[Killed] BlockStatement
src/sandbox/dockerBackend.ts:36:47
 export class DockerBackend implements SandboxBackend {
   private readonly docker: Docker;
 
-  constructor(private readonly image: string) {
-    this.docker = new Docker(); // defaults to /var/run/docker.sock
-  }
+  constructor(private readonly image: string) {}
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected 'Cannot read properties of undefined (…' to contain 'image \'llm-sandbox:slot2\' not found'

[Killed] BooleanLiteral
src/sandbox/dockerBackend.ts:42:9
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
     const runner = LANG_RUNNERS[language];
-    if (!runner) {
+    if (runner) {
       return {
         stdout: "",
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected 2 to be 1 // Object.is equality

[Survived] StringLiteral
src/sandbox/dockerBackend.ts:55:7
     // The container writes the provided code to the tmpfs and executes it. A shell
     // heredoc avoids mounting any host path into the untrusted container.
     const bootstrap =
-      `cat > ${WORKDIR}/${runner.filename} <<'__LLM_EOF__'\n` +
+      `` +
       `${code}\n` +
       `__LLM_EOF__\n` +

[Survived] BooleanLiteral
src/sandbox/dockerBackend.ts:62:20
 
     const started = process.hrtime.bigint();
     let container: Docker.Container | undefined;
-    let timedOut = false;
+    let timedOut = true;
 
     try {

[Survived] StringLiteral
src/sandbox/dockerBackend.ts:67:15
     try {
       container = await this.docker.createContainer({
         Image: this.image,
-        Cmd: ["sh", "-c", bootstrap],
+        Cmd: ["", "-c", bootstrap],
         Tty: false,
         WorkingDir: WORKDIR,

[Survived] BooleanLiteral
src/sandbox/dockerBackend.ts:68:14
       container = await this.docker.createContainer({
         Image: this.image,
         Cmd: ["sh", "-c", bootstrap],
-        Tty: false,
+        Tty: true,
         WorkingDir: WORKDIR,
         User: "1000:1000",

[Survived] ObjectLiteral
src/sandbox/dockerBackend.ts:71:21
         Tty: false,
         WorkingDir: WORKDIR,
         User: "1000:1000",
-        HostConfig: {
-          NetworkMode: "none",
-          Memory: limits.memoryMb * 1024 * 1024,
-          MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
-          NanoCpus: Math.round(limits.cpus * 1_000_000_000),
-          PidsLimit: limits.pidsLimit,
-          ReadonlyRootfs: true,
-          Tmpfs: {
-            [WORKDIR]: "rw,size=8m,mode=1777",
-            "/tmp": "rw,size=16m,mode=1777",
-          },
-          CapDrop: ["ALL"],
-          SecurityOpt: ["no-new-privileges"],
-          // Note: AutoRemove intentionally NOT set — we force-remove in finally so we
-          // can reliably read logs and enforce the timeout kill first (== Python --rm).
-        },
+        HostConfig: {},
       });
 

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:73:19
         User: "1000:1000",
         HostConfig: {
           NetworkMode: "none",
-          Memory: limits.memoryMb * 1024 * 1024,
+          Memory: limits.memoryMb / 1024 * 1024,
           MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:73:19
         User: "1000:1000",
         HostConfig: {
           NetworkMode: "none",
-          Memory: limits.memoryMb * 1024 * 1024,
+          Memory: limits.memoryMb * 1024 / 1024,
           MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:74:23
         HostConfig: {
           NetworkMode: "none",
           Memory: limits.memoryMb * 1024 * 1024,
-          MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
+          MemorySwap: limits.memoryMb / 1024 * 1024, // == Memory disables swap
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),
           PidsLimit: limits.pidsLimit,

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:74:23
         HostConfig: {
           NetworkMode: "none",
           Memory: limits.memoryMb * 1024 * 1024,
-          MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
+          MemorySwap: limits.memoryMb * 1024 / 1024, // == Memory disables swap
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),
           PidsLimit: limits.pidsLimit,

[Survived] ArithmeticOperator
src/sandbox/dockerBackend.ts:75:32
           NetworkMode: "none",
           Memory: limits.memoryMb * 1024 * 1024,
           MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
-          NanoCpus: Math.round(limits.cpus * 1_000_000_000),
+          NanoCpus: Math.round(limits.cpus / 1_000_000_000),
           PidsLimit: limits.pidsLimit,
           ReadonlyRootfs: true,

[Survived] BooleanLiteral
src/sandbox/dockerBackend.ts:77:27
           MemorySwap: limits.memoryMb * 1024 * 1024, // == Memory disables swap
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),
           PidsLimit: limits.pidsLimit,
-          ReadonlyRootfs: true,
+          ReadonlyRootfs: false,
           Tmpfs: {
             [WORKDIR]: "rw,size=8m,mode=1777",

[Survived] ObjectLiteral
src/sandbox/dockerBackend.ts:78:18
           NanoCpus: Math.round(limits.cpus * 1_000_000_000),
           PidsLimit: limits.pidsLimit,
           ReadonlyRootfs: true,
-          Tmpfs: {
-            [WORKDIR]: "rw,size=8m,mode=1777",
-            "/tmp": "rw,size=16m,mode=1777",
-          },
+          Tmpfs: {},
           CapDrop: ["ALL"],
           SecurityOpt: ["no-new-privileges"],

[Survived] StringLiteral
src/sandbox/dockerBackend.ts:79:24
           PidsLimit: limits.pidsLimit,
           ReadonlyRootfs: true,
           Tmpfs: {
-            [WORKDIR]: "rw,size=8m,mode=1777",
+            [WORKDIR]: "",
             "/tmp": "rw,size=16m,mode=1777",
           },

[Survived] StringLiteral
src/sandbox/dockerBackend.ts:80:21
           ReadonlyRootfs: true,
           Tmpfs: {
             [WORKDIR]: "rw,size=8m,mode=1777",
-            "/tmp": "rw,size=16m,mode=1777",
+            "/tmp": "",
           },
           CapDrop: ["ALL"],

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:94:28
       const stderrChunks: Buffer[] = [];
       const outStream = new PassThrough();
       const errStream = new PassThrough();
-      outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
+      outStream.on("data", () => undefined);
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });

[NoCoverage] CallExpression
src/sandbox/dockerBackend.ts:94:7
       const stderrChunks: Buffer[] = [];
       const outStream = new PassThrough();
       const errStream = new PassThrough();
-      outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
+      ;
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });

[NoCoverage] CallExpression
src/sandbox/dockerBackend.ts:95:7
       const outStream = new PassThrough();
       const errStream = new PassThrough();
       outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
-      errStream.on("data", (c: Buffer) => stderrChunks.push(c));
+      ;
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });
       this.docker.modem.demuxStream(attach, outStream, errStream);

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:95:28
       const outStream = new PassThrough();
       const errStream = new PassThrough();
       outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
-      errStream.on("data", (c: Buffer) => stderrChunks.push(c));
+      errStream.on("data", () => undefined);
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });
       this.docker.modem.demuxStream(attach, outStream, errStream);

[NoCoverage] BooleanLiteral
src/sandbox/dockerBackend.ts:96:69
       const errStream = new PassThrough();
       outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
-      const attach = await container.attach({ stream: true, stdout: true, stderr: true });
+      const attach = await container.attach({ stream: true, stdout: false, stderr: true });
       this.docker.modem.demuxStream(attach, outStream, errStream);
       const streamEnded = new Promise<void>((resolve) => {

[NoCoverage] BooleanLiteral
src/sandbox/dockerBackend.ts:96:83
       const errStream = new PassThrough();
       outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
-      const attach = await container.attach({ stream: true, stdout: true, stderr: true });
+      const attach = await container.attach({ stream: true, stdout: true, stderr: false });
       this.docker.modem.demuxStream(attach, outStream, errStream);
       const streamEnded = new Promise<void>((resolve) => {

[NoCoverage] CallExpression
src/sandbox/dockerBackend.ts:97:7
       outStream.on("data", (c: Buffer) => stdoutChunks.push(c));
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });
-      this.docker.modem.demuxStream(attach, outStream, errStream);
+      ;
       const streamEnded = new Promise<void>((resolve) => {
         attach.on("end", () => resolve());

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:98:58
       errStream.on("data", (c: Buffer) => stderrChunks.push(c));
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });
       this.docker.modem.demuxStream(attach, outStream, errStream);
-      const streamEnded = new Promise<void>((resolve) => {
-        attach.on("end", () => resolve());
-        attach.on("close", () => resolve());
-        attach.on("error", () => resolve());
-      });
+      const streamEnded = new Promise<void>((resolve) => {});
 
       await container.start();

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:99:26
       const attach = await container.attach({ stream: true, stdout: true, stderr: true });
       this.docker.modem.demuxStream(attach, outStream, errStream);
       const streamEnded = new Promise<void>((resolve) => {
-        attach.on("end", () => resolve());
+        attach.on("end", () => undefined);
         attach.on("close", () => resolve());
         attach.on("error", () => resolve());

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:100:28
       this.docker.modem.demuxStream(attach, outStream, errStream);
       const streamEnded = new Promise<void>((resolve) => {
         attach.on("end", () => resolve());
-        attach.on("close", () => resolve());
+        attach.on("close", () => undefined);
         attach.on("error", () => resolve());
       });

[NoCoverage] StringLiteral
src/sandbox/dockerBackend.ts:100:19
       this.docker.modem.demuxStream(attach, outStream, errStream);
       const streamEnded = new Promise<void>((resolve) => {
         attach.on("end", () => resolve());
-        attach.on("close", () => resolve());
+        attach.on("", () => resolve());
         attach.on("error", () => resolve());
       });

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:101:28
       const streamEnded = new Promise<void>((resolve) => {
         attach.on("end", () => resolve());
         attach.on("close", () => resolve());
-        attach.on("error", () => resolve());
+        attach.on("error", () => undefined);
       });
 

[NoCoverage] ArithmeticOperator
src/sandbox/dockerBackend.ts:107:25
       await container.start();
 
       const waitPromise = container.wait();
-      const timeoutMs = limits.timeoutSeconds * 1000;
+      const timeoutMs = limits.timeoutSeconds / 1000;
       // Cancelable timer: clear it when wait wins so we don't leave a live ref'd
       // setTimeout per execution (they'd accumulate for the full timeout under load).

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:111:76
       // Cancelable timer: clear it when wait wins so we don't leave a live ref'd
       // setTimeout per execution (they'd accumulate for the full timeout under load).
       let timeoutHandle: ReturnType<typeof setTimeout> | undefined;
-      const timeoutPromise = new Promise<{ kind: "timeout" }>((resolve) => {
-        timeoutHandle = setTimeout(() => resolve({ kind: "timeout" as const }), timeoutMs);
-      });
+      const timeoutPromise = new Promise<{ kind: "timeout" }>((resolve) => {});
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };
       try {

[NoCoverage] ArrowFunction
src/sandbox/dockerBackend.ts:112:36
       // setTimeout per execution (they'd accumulate for the full timeout under load).
       let timeoutHandle: ReturnType<typeof setTimeout> | undefined;
       const timeoutPromise = new Promise<{ kind: "timeout" }>((resolve) => {
-        timeoutHandle = setTimeout(() => resolve({ kind: "timeout" as const }), timeoutMs);
+        timeoutHandle = setTimeout(() => undefined, timeoutMs);
       });
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };

[NoCoverage] ObjectLiteral
src/sandbox/dockerBackend.ts:112:50
       // setTimeout per execution (they'd accumulate for the full timeout under load).
       let timeoutHandle: ReturnType<typeof setTimeout> | undefined;
       const timeoutPromise = new Promise<{ kind: "timeout" }>((resolve) => {
-        timeoutHandle = setTimeout(() => resolve({ kind: "timeout" as const }), timeoutMs);
+        timeoutHandle = setTimeout(() => resolve({}), timeoutMs);
       });
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:115:11
         timeoutHandle = setTimeout(() => resolve({ kind: "timeout" as const }), timeoutMs);
       });
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };
-      try {
-        outcome = await Promise.race([
-          waitPromise.then((r) => ({ kind: "done" as const, code: Number(r?.StatusCode ?? -1) })),
-          timeoutPromise,
-        ]);
-      } finally {
+      try {} finally {
         if (timeoutHandle) clearTimeout(timeoutHandle);
       }

[NoCoverage] OptionalChaining
src/sandbox/dockerBackend.ts:117:74
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };
       try {
         outcome = await Promise.race([
-          waitPromise.then((r) => ({ kind: "done" as const, code: Number(r?.StatusCode ?? -1) })),
+          waitPromise.then((r) => ({ kind: "done" as const, code: Number(r.StatusCode ?? -1) })),
           timeoutPromise,
         ]);

[NoCoverage] LogicalOperator
src/sandbox/dockerBackend.ts:117:74
       let outcome: { kind: "done"; code: number } | { kind: "timeout" };
       try {
         outcome = await Promise.race([
-          waitPromise.then((r) => ({ kind: "done" as const, code: Number(r?.StatusCode ?? -1) })),
+          waitPromise.then((r) => ({ kind: "done" as const, code: Number(r?.StatusCode && -1) })),
           timeoutPromise,
         ]);

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:120:17
           waitPromise.then((r) => ({ kind: "done" as const, code: Number(r?.StatusCode ?? -1) })),
           timeoutPromise,
         ]);
-      } finally {
-        if (timeoutHandle) clearTimeout(timeoutHandle);
-      }
+      } finally {}
 
       let exitCode: number;

[NoCoverage] ConditionalExpression
src/sandbox/dockerBackend.ts:121:13
           timeoutPromise,
         ]);
       } finally {
-        if (timeoutHandle) clearTimeout(timeoutHandle);
+        if (false) clearTimeout(timeoutHandle);
       }
 

[NoCoverage] CallExpression
src/sandbox/dockerBackend.ts:121:28
           timeoutPromise,
         ]);
       } finally {
-        if (timeoutHandle) clearTimeout(timeoutHandle);
+        if (timeoutHandle) ;
       }
 

[NoCoverage] ConditionalExpression
src/sandbox/dockerBackend.ts:125:11
       }
 
       let exitCode: number;
-      if (outcome.kind === "timeout") {
+      if (true) {
         timedOut = true;
         exitCode = 124;

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:125:39
       }
 
       let exitCode: number;
-      if (outcome.kind === "timeout") {
-        timedOut = true;
-        exitCode = 124;
-        await container.kill().catch(() => {});
-        await waitPromise.catch(() => {}); // let wait settle after the kill
-      } else {
+      if (outcome.kind === "timeout") {} else {
         exitCode = outcome.code;
       }

[NoCoverage] BooleanLiteral
src/sandbox/dockerBackend.ts:126:20
 
       let exitCode: number;
       if (outcome.kind === "timeout") {
-        timedOut = true;
+        timedOut = false;
         exitCode = 124;
         await container.kill().catch(() => {});

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:130:14
         exitCode = 124;
         await container.kill().catch(() => {});
         await waitPromise.catch(() => {}); // let wait settle after the kill
-      } else {
-        exitCode = outcome.code;
-      }
+      } else {}
 
       // Bounded flush of the attach stream so buffered output lands.

[NoCoverage] ConditionalExpression
src/sandbox/dockerBackend.ts:140:11
       const durationMs = elapsedMs(started);
       const stdout = Buffer.concat(stdoutChunks).toString("utf8");
       let stderr = Buffer.concat(stderrChunks).toString("utf8");
-      if (timedOut) {
+      if (true) {
         stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`.trim();
       }

[NoCoverage] ConditionalExpression
src/sandbox/dockerBackend.ts:140:11
       const durationMs = elapsedMs(started);
       const stdout = Buffer.concat(stdoutChunks).toString("utf8");
       let stderr = Buffer.concat(stderrChunks).toString("utf8");
-      if (timedOut) {
+      if (false) {
         stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`.trim();
       }

[NoCoverage] MethodExpression
src/sandbox/dockerBackend.ts:141:18
       const stdout = Buffer.concat(stdoutChunks).toString("utf8");
       let stderr = Buffer.concat(stderrChunks).toString("utf8");
       if (timedOut) {
-        stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`.trim();
+        stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`;
       }
 

[NoCoverage] StringLiteral
src/sandbox/dockerBackend.ts:141:18
       const stdout = Buffer.concat(stdoutChunks).toString("utf8");
       let stderr = Buffer.concat(stderrChunks).toString("utf8");
       if (timedOut) {
-        stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`.trim();
+        stderr = ``.trim();
       }
 

[NoCoverage] ObjectLiteral
src/sandbox/dockerBackend.ts:144:14
         stderr = `${stderr}\n[sandbox] killed after ${limits.timeoutSeconds}s timeout`.trim();
       }
 
-      return {
-        stdout: truncate(stdout, limits.maxOutputChars),
-        stderr: truncate(stderr, limits.maxOutputChars),
-        exitCode,
-        durationMs,
-        timedOut,
-      };
+      return {};
     } catch (err) {
       const e = err as { statusCode?: number; message?: string };

[Killed] BlockStatement
src/sandbox/dockerBackend.ts:151:19
         durationMs,
         timedOut,
       };
-    } catch (err) {
-      const e = err as { statusCode?: number; message?: string };
-      if (e?.statusCode === 404) {
-        return {
-          stdout: "",
-          stderr:
-            `[sandbox] image '${this.image}' not found. Build it first: ` +
-            `\`docker build -t ${this.image} backend/sandbox-image\`.`,
-          exitCode: 1,
-          durationMs: elapsedMs(started),
-          timedOut: false,
-        };
-      }
-      return {
-        stdout: "",
-        stderr: truncate(String(e?.message ?? err), limits.maxOutputChars),
-        exitCode: 1,
-        durationMs: elapsedMs(started),
-        timedOut: false,
-      };
-    } finally {
+    } catch (err) {} finally {
       if (container) {
         await container.remove({ force: true }).catch(() => {}); // ensure --rm even on timeout
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: Cannot read properties of undefined (reading 'exitCode')

[Killed] BlockStatement
src/sandbox/dockerBackend.ts:153:34
       };
     } catch (err) {
       const e = err as { statusCode?: number; message?: string };
-      if (e?.statusCode === 404) {
-        return {
-          stdout: "",
-          stderr:
-            `[sandbox] image '${this.image}' not found. Build it first: ` +
-            `\`docker build -t ${this.image} backend/sandbox-image\`.`,
-          exitCode: 1,
-          durationMs: elapsedMs(started),
-          timedOut: false,
-        };
-      }
+      if (e?.statusCode === 404) {}
       return {
         stdout: "",
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected 'no such image' to contain 'image \'llm-sandbox:slot2\' not found'

[Killed] EqualityOperator
src/sandbox/dockerBackend.ts:153:11
       };
     } catch (err) {
       const e = err as { statusCode?: number; message?: string };
-      if (e?.statusCode === 404) {
+      if (e?.statusCode !== 404) {
         return {
           stdout: "",
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected 'no such image' to contain 'image \'llm-sandbox:slot2\' not found'

[Killed] StringLiteral
src/sandbox/dockerBackend.ts:157:13
         return {
           stdout: "",
           stderr:
-            `[sandbox] image '${this.image}' not found. Build it first: ` +
+            `` +
             `\`docker build -t ${this.image} backend/sandbox-image\`.`,
           exitCode: 1,
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected '`docker build -t llm-sandbox:slot2 ba…' to contain 'image \'llm-sandbox:slot2\' not found'

[Killed] StringLiteral
src/sandbox/dockerBackend.ts:158:13
           stdout: "",
           stderr:
             `[sandbox] image '${this.image}' not found. Build it first: ` +
-            `\`docker build -t ${this.image} backend/sandbox-image\`.`,
+            ``,
           exitCode: 1,
           durationMs: elapsedMs(started),
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: expected '[sandbox] image \'llm-sandbox:slot2\'…' to contain 'docker build -t llm-sandbox:slot2 bac…'

[Survived] BooleanLiteral
src/sandbox/dockerBackend.ts:161:21
             `\`docker build -t ${this.image} backend/sandbox-image\`.`,
           exitCode: 1,
           durationMs: elapsedMs(started),
-          timedOut: false,
+          timedOut: true,
         };
       }

[NoCoverage] ObjectLiteral
src/sandbox/dockerBackend.ts:164:14
           timedOut: false,
         };
       }
-      return {
-        stdout: "",
-        stderr: truncate(String(e?.message ?? err), limits.maxOutputChars),
-        exitCode: 1,
-        durationMs: elapsedMs(started),
-        timedOut: false,
-      };
+      return {};
     } finally {
       if (container) {

[NoCoverage] OptionalChaining
src/sandbox/dockerBackend.ts:166:33
       }
       return {
         stdout: "",
-        stderr: truncate(String(e?.message ?? err), limits.maxOutputChars),
+        stderr: truncate(String(e.message ?? err), limits.maxOutputChars),
         exitCode: 1,
         durationMs: elapsedMs(started),

[NoCoverage] LogicalOperator
src/sandbox/dockerBackend.ts:166:33
       }
       return {
         stdout: "",
-        stderr: truncate(String(e?.message ?? err), limits.maxOutputChars),
+        stderr: truncate(String(e?.message && err), limits.maxOutputChars),
         exitCode: 1,
         durationMs: elapsedMs(started),

[Survived] BlockStatement
src/sandbox/dockerBackend.ts:171:15
         durationMs: elapsedMs(started),
         timedOut: false,
       };
-    } finally {
-      if (container) {
-        await container.remove({ force: true }).catch(() => {}); // ensure --rm even on timeout
-      }
-    }
+    } finally {}
   }
 }

[Killed] ConditionalExpression
src/sandbox/dockerBackend.ts:172:11
         timedOut: false,
       };
     } finally {
-      if (container) {
+      if (true) {
         await container.remove({ force: true }).catch(() => {}); // ensure --rm even on timeout
       }
killedBy: DockerBackend: image not found names the image it actually looked for, in both halves of the message
statusReason: Cannot read properties of undefined (reading 'remove')

[NoCoverage] BlockStatement
src/sandbox/dockerBackend.ts:172:22
         timedOut: false,
       };
     } finally {
-      if (container) {
-        await container.remove({ force: true }).catch(() => {}); // ensure --rm even on timeout
-      }
+      if (container) {}
     }
   }
