[NoCoverage] BooleanLiteral
src/sandbox/dockerBackend.ts:173:41
       };
     } finally {
       if (container) {
-        await container.remove({ force: true }).catch(() => {}); // ensure --rm even on timeout
+        await container.remove({ force: false }).catch(() => {}); // ensure --rm even on timeout
       }
     }
