[Survived] BlockStatement
src/limits/memoryQuota.ts:27:36
   private readonly windows = new Map<string, Window>();
 
   /** Drop windows that have already reset. O(n), amortised by the threshold check. */
-  private sweep(now: number): void {
-    for (const [k, w] of this.windows) {
-      if (now >= w.resetAtMs) this.windows.delete(k);
-    }
-  }
+  private sweep(now: number): void {}
 
   /**

[Survived] BlockStatement
src/limits/memoryQuota.ts:28:40
 
   /** Drop windows that have already reset. O(n), amortised by the threshold check. */
   private sweep(now: number): void {
-    for (const [k, w] of this.windows) {
-      if (now >= w.resetAtMs) this.windows.delete(k);
-    }
+    for (const [k, w] of this.windows) {}
   }
 

[Survived] ConditionalExpression
src/limits/memoryQuota.ts:29:11
   /** Drop windows that have already reset. O(n), amortised by the threshold check. */
   private sweep(now: number): void {
     for (const [k, w] of this.windows) {
-      if (now >= w.resetAtMs) this.windows.delete(k);
+      if (false) this.windows.delete(k);
     }
   }

[Survived] ConditionalExpression
src/limits/memoryQuota.ts:29:11
   /** Drop windows that have already reset. O(n), amortised by the threshold check. */
   private sweep(now: number): void {
     for (const [k, w] of this.windows) {
-      if (now >= w.resetAtMs) this.windows.delete(k);
+      if (true) this.windows.delete(k);
     }
   }

[Killed] BlockStatement
src/limits/memoryQuota.ts:40:65
    * expiring early and granting capacity sooner than Redis does. The two stores would then
    * disagree exactly where the contract suite claims they agree.
    */
-  private peek(key: string, limit: number, now: number): number {
-    const w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
-    if (w.count < limit) return 0;
-    return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
-  }
+  private peek(key: string, limit: number, now: number): number {}
 
   /** Charge one request, creating or rolling the window as needed. */
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/limits/memoryQuota.ts:42:15
    */
   private peek(key: string, limit: number, now: number): number {
     const w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
+    if (!w || now < w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
     if (w.count < limit) return 0;
     return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/limits/memoryQuota.ts:42:9
    */
   private peek(key: string, limit: number, now: number): number {
     const w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
+    if (w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
     if (w.count < limit) return 0;
     return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
killedBy: QuotaStore contract: MemoryQuotaStore allows requests below the burst limit
statusReason: Cannot read properties of undefined (reading 'resetAtMs')

[Killed] EqualityOperator
src/limits/memoryQuota.ts:43:9
   private peek(key: string, limit: number, now: number): number {
     const w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
-    if (w.count < limit) return 0;
+    if (w.count <= limit) return 0;
     return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
   }
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/limits/memoryQuota.ts:43:9
   private peek(key: string, limit: number, now: number): number {
     const w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
-    if (w.count < limit) return 0;
+    if (false) return 0;
     return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
   }
killedBy: QuotaStore contract: MemoryQuotaStore allows requests below the burst limit
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/limits/memoryQuota.ts:44:12
     const w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
     if (w.count < limit) return 0;
-    return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
+    return Math.min(1, Math.ceil((w.resetAtMs - now) / 1000));
   }
 
killedBy: QuotaStore contract: MemoryQuotaStore reports the LONGEST wait when both windows are exhausted
statusReason: expected 1 to be greater than 1

[Killed] ArithmeticOperator
src/limits/memoryQuota.ts:44:35
     const w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) return 0; // absent or rolled over ⇒ empty ⇒ room
     if (w.count < limit) return 0;
-    return Math.max(1, Math.ceil((w.resetAtMs - now) / 1000));
+    return Math.max(1, Math.ceil((w.resetAtMs + now) / 1000));
   }
 
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected 3576396122 to be less than or equal to 60

[Killed] BlockStatement
src/limits/memoryQuota.ts:48:73
   }
 
   /** Charge one request, creating or rolling the window as needed. */
-  private charge(key: string, windowSeconds: number, now: number): void {
-    let w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) {
-      w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
-      this.windows.set(key, w);
-    }
-    w.count += 1;
-  }
+  private charge(key: string, windowSeconds: number, now: number): void {}
 
   async consume(key: string, limits: QuotaLimits): Promise<QuotaDecision> {
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/limits/memoryQuota.ts:50:9
   /** Charge one request, creating or rolling the window as needed. */
   private charge(key: string, windowSeconds: number, now: number): void {
     let w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) {
+    if (false) {
       w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
       this.windows.set(key, w);
killedBy: QuotaStore contract: MemoryQuotaStore allows requests below the burst limit
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] EqualityOperator
src/limits/memoryQuota.ts:50:15
   /** Charge one request, creating or rolling the window as needed. */
   private charge(key: string, windowSeconds: number, now: number): void {
     let w = this.windows.get(key);
-    if (!w || now >= w.resetAtMs) {
+    if (!w || now < w.resetAtMs) {
       w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
       this.windows.set(key, w);
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 to be 429 // Object.is equality

[Killed] ArithmeticOperator
src/limits/memoryQuota.ts:51:40
   private charge(key: string, windowSeconds: number, now: number): void {
     let w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) {
-      w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
+      w = { count: 0, resetAtMs: now + windowSeconds / 1000 };
       this.windows.set(key, w);
     }
killedBy: QuotaStore contract: MemoryQuotaStore does not consume quota for refused requests
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/limits/memoryQuota.ts:51:34
   private charge(key: string, windowSeconds: number, now: number): void {
     let w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) {
-      w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
+      w = { count: 0, resetAtMs: now - windowSeconds * 1000 };
       this.windows.set(key, w);
     }
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
src/limits/memoryQuota.ts:52:7
     let w = this.windows.get(key);
     if (!w || now >= w.resetAtMs) {
       w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
-      this.windows.set(key, w);
+      ;
     }
     w.count += 1;
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 to be 429 // Object.is equality

[Killed] AssignmentOperator
src/limits/memoryQuota.ts:54:5
       w = { count: 0, resetAtMs: now + windowSeconds * 1000 };
       this.windows.set(key, w);
     }
-    w.count += 1;
+    w.count -= 1;
   }
 
killedBy: QuotaStore contract: MemoryQuotaStore refuses once the burst limit is reached, with a positive retry hint (S1)
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/limits/memoryQuota.ts:57:75
     w.count += 1;
   }
 
-  async consume(key: string, limits: QuotaLimits): Promise<QuotaDecision> {
-    const now = Date.now();
-    if (this.windows.size >= SWEEP_THRESHOLD) this.sweep(now);
-
-    // Evaluate BOTH windows and refuse with the LONGEST wait: reporting the burst window's
-    // shorter TTL while the sustained window is also full would guarantee an obedient client a
-    // second 429. Checking before charging also means a refusal costs nothing.
-    const wait = Math.max(
-      this.peek(`${key}:b`, limits.burst, now),
-      this.peek(`${key}:s`, limits.sustained, now),
-    );
-    if (wait > 0) return { allowed: false, retryAfterSeconds: wait };
-
-    this.charge(`${key}:b`, limits.burstWindowSeconds, now);
-    this.charge(`${key}:s`, limits.sustainedWindowSeconds, now);
-    return { allowed: true };
-  }
+  async consume(key: string, limits: QuotaLimits): Promise<QuotaDecision> {}
 
   async usage(key: string): Promise<{ burst: number; sustained: number }> {
killedBy: QuotaStore contract: MemoryQuotaStore allows requests below the burst limit
statusReason: Cannot read properties of undefined (reading 'allowed')

[Survived] CallExpression
src/limits/memoryQuota.ts:59:47
 
   async consume(key: string, limits: QuotaLimits): Promise<QuotaDecision> {
     const now = Date.now();
-    if (this.windows.size >= SWEEP_THRESHOLD) this.sweep(now);
+    if (this.windows.size >= SWEEP_THRESHOLD) ;
 
     // Evaluate BOTH windows and refuse with the LONGEST wait: reporting the burst window's

[Survived] EqualityOperator
src/limits/memoryQuota.ts:59:9
 
   async consume(key: string, limits: QuotaLimits): Promise<QuotaDecision> {
     const now = Date.now();
-    if (this.windows.size >= SWEEP_THRESHOLD) this.sweep(now);
+    if (this.windows.size > SWEEP_THRESHOLD) this.sweep(now);
 
     // Evaluate BOTH windows and refuse with the LONGEST wait: reporting the burst window's

[Killed] MethodExpression
src/limits/memoryQuota.ts:64:18
     // Evaluate BOTH windows and refuse with the LONGEST wait: reporting the burst window's
     // shorter TTL while the sustained window is also full would guarantee an obedient client a
     // second 429. Checking before charging also means a refusal costs nothing.
-    const wait = Math.max(
-      this.peek(`${key}:b`, limits.burst, now),
-      this.peek(`${key}:s`, limits.sustained, now),
-    );
+    const wait = Math.min(this.peek(`${key}:b`, limits.burst, now), this.peek(`${key}:s`, limits.sustained, now));
     if (wait > 0) return { allowed: false, retryAfterSeconds: wait };
 
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 to be 429 // Object.is equality

[Killed] EqualityOperator
src/limits/memoryQuota.ts:68:9
       this.peek(`${key}:b`, limits.burst, now),
       this.peek(`${key}:s`, limits.sustained, now),
     );
-    if (wait > 0) return { allowed: false, retryAfterSeconds: wait };
+    if (wait >= 0) return { allowed: false, retryAfterSeconds: wait };
 
     this.charge(`${key}:b`, limits.burstWindowSeconds, now);
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 "OK", got 429 "Too Many Requests"

[Killed] EqualityOperator
src/limits/memoryQuota.ts:68:9
       this.peek(`${key}:b`, limits.burst, now),
       this.peek(`${key}:s`, limits.sustained, now),
     );
-    if (wait > 0) return { allowed: false, retryAfterSeconds: wait };
+    if (wait <= 0) return { allowed: false, retryAfterSeconds: wait };
 
     this.charge(`${key}:b`, limits.burstWindowSeconds, now);
killedBy: quota middleware returns 429 with Retry-After once the quota is exhausted (S1)
statusReason: expected 200 "OK", got 429 "Too Many Requests"

[Killed] BooleanLiteral
src/limits/memoryQuota.ts:72:23
 
     this.charge(`${key}:b`, limits.burstWindowSeconds, now);
     this.charge(`${key}:s`, limits.sustainedWindowSeconds, now);
-    return { allowed: true };
+    return { allowed: false };
   }
 
killedBy: QuotaStore contract: MemoryQuotaStore allows requests below the burst limit
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/limits/memoryQuota.ts:75:75
     return { allowed: true };
   }
 
-  async usage(key: string): Promise<{ burst: number; sustained: number }> {
-    const now = Date.now();
-    const read = (k: string): number => {
-      const w = this.windows.get(k);
-      return !w || now >= w.resetAtMs ? 0 : w.count;
-    };
-    return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
-  }
+  async usage(key: string): Promise<{ burst: number; sustained: number }> {}
 
   async close(): Promise<void> {}
killedBy: QuotaStore contract: MemoryQuotaStore does not consume quota for refused requests
statusReason: expected undefined to deeply equal { burst: 3, sustained: 3 }

[Killed] BlockStatement
src/limits/memoryQuota.ts:77:41
 
   async usage(key: string): Promise<{ burst: number; sustained: number }> {
     const now = Date.now();
-    const read = (k: string): number => {
-      const w = this.windows.get(k);
-      return !w || now >= w.resetAtMs ? 0 : w.count;
-    };
+    const read = (k: string): number => {};
     return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
   }
killedBy: QuotaStore contract: MemoryQuotaStore does not consume quota for refused requests
statusReason: expected { burst: undefined, …(1) } to deeply equal { burst: 3, sustained: 3 }

[Killed] BooleanLiteral
src/limits/memoryQuota.ts:79:14
     const now = Date.now();
     const read = (k: string): number => {
       const w = this.windows.get(k);
-      return !w || now >= w.resetAtMs ? 0 : w.count;
+      return w || now >= w.resetAtMs ? 0 : w.count;
     };
     return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
killedBy: QuotaStore contract: MemoryQuotaStore does not consume quota for refused requests
statusReason: expected { burst: +0, sustained: +0 } to deeply equal { burst: 3, sustained: 3 }

[Killed] ConditionalExpression
src/limits/memoryQuota.ts:79:14
     const now = Date.now();
     const read = (k: string): number => {
       const w = this.windows.get(k);
-      return !w || now >= w.resetAtMs ? 0 : w.count;
+      return false ? 0 : w.count;
     };
     return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
killedBy: QuotaStore contract: MemoryQuotaStore keeps state bounded as identities accumulate (S6)
statusReason: Cannot read properties of undefined (reading 'count')

[Killed] StringLiteral
src/limits/memoryQuota.ts:81:26
       const w = this.windows.get(k);
       return !w || now >= w.resetAtMs ? 0 : w.count;
     };
-    return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
+    return { burst: read(``), sustained: read(`${key}:s`) };
   }
 
killedBy: quota middleware charges the no-code path too (S4)
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/limits/memoryQuota.ts:81:55
       const w = this.windows.get(k);
       return !w || now >= w.resetAtMs ? 0 : w.count;
     };
-    return { burst: read(`${key}:b`), sustained: read(`${key}:s`) };
+    return { burst: read(`${key}:b`), sustained: read(``) };
   }
 
killedBy: QuotaStore contract: MemoryQuotaStore does not consume quota for refused requests
statusReason: expected { burst: 3, sustained: +0 } to deeply equal { burst: 3, sustained: 3 }
