[Killed] BlockStatement
src/limits/quota.ts:44:57
  * anonymous bucket is effectively a global rate limit, which is the right posture for a
  * mode that only exists for local development.
  */
-export function quotaKey(userId: string | null): string {
-  return userId === null ? "quota:anon" : `quota:user:${userId}`;
-}
+export function quotaKey(userId: string | null): string {}
 
killedBy: quota middleware throttling one user does not affect another (S2)
statusReason: expected 200 "OK", got 429 "Too Many Requests"

[Killed] EqualityOperator
src/limits/quota.ts:45:10
  * mode that only exists for local development.
  */
 export function quotaKey(userId: string | null): string {
-  return userId === null ? "quota:anon" : `quota:user:${userId}`;
+  return userId !== null ? "quota:anon" : `quota:user:${userId}`;
 }
 
killedBy: quota middleware throttling one user does not affect another (S2)
statusReason: expected 200 "OK", got 429 "Too Many Requests"

[Killed] ConditionalExpression
src/limits/quota.ts:45:10
  * mode that only exists for local development.
  */
 export function quotaKey(userId: string | null): string {
-  return userId === null ? "quota:anon" : `quota:user:${userId}`;
+  return true ? "quota:anon" : `quota:user:${userId}`;
 }
 
killedBy: quota middleware throttling one user does not affect another (S2)
statusReason: expected 200 "OK", got 429 "Too Many Requests"
