[Killed] BlockStatement
src/sandbox/concurrencyLimited.ts:32:98
     private readonly retryAfterSeconds: number,
   ) {}
 
-  async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
-    const release = this.limiter.tryAcquire();
-    if (release === null) {
-      // 503, not 429: the quota already passed, so this caller is inside its own allowance
-      // and is being refused because of OTHER users' load. 429 would blame the wrong party.
-      throw new HttpError(
-        503,
-        "The service is at capacity. Please retry in a few seconds.",
-        this.retryAfterSeconds,
-      );
-    }
-    try {
-      return await this.inner.execute(code, language, limits);
-    } finally {
-      release();
-    }
-  }
+  async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {}
 }
 
killedBy: ConcurrencyLimiter releases the slot when the inner backend throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/sandbox/concurrencyLimited.ts:34:27
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
     const release = this.limiter.tryAcquire();
-    if (release === null) {
-      // 503, not 429: the quota already passed, so this caller is inside its own allowance
-      // and is being refused because of OTHER users' load. 429 would blame the wrong party.
-      throw new HttpError(
-        503,
-        "The service is at capacity. Please retry in a few seconds.",
-        this.retryAfterSeconds,
-      );
-    }
+    if (release === null) {}
     try {
       return await this.inner.execute(code, language, limits);
killedBy: ConcurrencyLimiter refuses with 503 rather than launching beyond the cap (S5)
statusReason: expected TypeError: release is not a function to match object { status: 503 }

[Killed] EqualityOperator
src/sandbox/concurrencyLimited.ts:34:9
 
   async execute(code: string, language: string, limits: ExecutionLimits): Promise<SandboxResult> {
     const release = this.limiter.tryAcquire();
-    if (release === null) {
+    if (release !== null) {
       // 503, not 429: the quota already passed, so this caller is inside its own allowance
       // and is being refused because of OTHER users' load. 429 would blame the wrong party.
killedBy: ConcurrencyLimiter releases the slot when the inner backend throws
statusReason: expected [Function] to throw error including 'boom' but got 'The service is at capacity. Please re…'

[Killed] BlockStatement
src/sandbox/concurrencyLimited.ts:43:9
         this.retryAfterSeconds,
       );
     }
-    try {
-      return await this.inner.execute(code, language, limits);
-    } finally {
+    try {} finally {
       release();
     }
killedBy: ConcurrencyLimiter releases the slot when the inner backend throws
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/sandbox/concurrencyLimited.ts:45:15
     }
     try {
       return await this.inner.execute(code, language, limits);
-    } finally {
-      release();
-    }
+    } finally {}
   }
 }
killedBy: ConcurrencyLimiter releases the slot when the inner backend throws
statusReason: expected true to be false // Object.is equality
